no_air/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	compressibleInterNoTFoam;

startFrom       	latestTime;

startTime       	0;

stopAt          	endTime;

endTime         	2;

deltaT          	1e-7;

writeControl    	adjustableRunTime;

writeInterval   	5e-3;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision  	8;

writeCompression 	off;

timeFormat      	general;

timePrecision   	8;

runTimeModifiable 	yes;

adjustTimeStep  	yes;

maxCo				      0.5;
maxAlphaCo			  0.5;

maxDeltaT			1e-2;



// ************************************************************************* //
